# Без ввода данных без math:
#---------------------------
print('\n')
sum = 20000
t = 5
per = 15

D = sum * ((1 + (per/100)/12)**t)
print('Рассчётное значение без ввода данных: %.2f BYN\n' % D)

# С вводом данных и с math:
#--------------------------
import math

sum = input('Введите сумму депозита: \n')
t = input('Введите срок: \n')
per = input('Введите процент: \n')

sum = int(sum)
t = int(t)
per = int(per)
D = sum * math.pow((1 + (per/100)/12), t)
print('Сумма депозита по окончании срока: %.2f BYN' % D)
print('\n')